Revit 2027 API
DuctFittingAndAccessoryPressureDropData.GetDuctFittingAndAccessoryData Method
 Returns the fitting and accessory information.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData()
Public Function GetDuctFittingAndAccessoryData As DuctFittingAndAccessoryData
public:
DuctFittingAndAccessoryData^ GetDuctFittingAndAccessoryData()
member GetDuctFittingAndAccessoryData : unit -> DuctFittingAndAccessoryData
Return Value
DuctFittingAndAccessoryData
See Also
Reference
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace